In [41]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [42]:
data = pd.read_csv("train.csv")

In [43]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [44]:
data.drop(["Name","Fare"],axis = 1,inplace=True)

In [45]:
data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,NaN,S
3,4,1,1,female,35.0,1,0,113803,C123,S
4,5,0,3,male,35.0,0,0,373450,NaN,S

In [48]:
data.drop(["PassengerId"],axis = 1,inplace=True)

KeyError: "['PassengerId'] not found in axis"

In [49]:
data.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,NaN,S
1,1,1,female,38.0,1,0,PC 17599,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,NaN,S
3,1,1,female,35.0,1,0,113803,C123,S
4,0,3,male,35.0,0,0,373450,NaN,S

In [50]:
data.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Cabin       687
Embarked      2
dtype: int64

In [51]:
for i in data.columns:
    print("{} {}".format(i,data[i].nunique()))

Survived 2
Pclass 3
Sex 2
Age 88
SibSp 7
Parch 7
Ticket 681
Cabin 147
Embarked 3

In [52]:
type(i)

str

In [53]:
data[i]

0      S
1      C
2      S
3      S
4      S
5      Q
6      S
7      S
8      S
9      C
10     S
11     S
12     S
13     S
14     S
15     S
16     Q
17     S
18     S
19     C
20     S
21     S
22     Q
23     S
24     S
25     S
26     C
27     S
28     Q
29     S
      ..
861    S
862    S
863    S
864    S
865    S
866    C
867    S
868    S
869    S
870    S
871    S
872    S
873    S
874    C
875    C
876    S
877    S
878    S
879    C
880    S
881    S
882    S
883    S
884    S
885    Q
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [54]:
data.drop("Ticket",axis = 1, inplace=True)

In [55]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Cabin Embarked
0         0       3    male  22.0      1      0   NaN        S
1         1       1  female  38.0      1      0   C85        C
2         1       3  female  26.0      0      0   NaN        S
3         1       1  female  35.0      1      0  C123        S
4         0       3    male  35.0      0      0   NaN        S

In [56]:
for i in data.columns:
    print("{} {}".format(i,data[i].nunique()))

Survived 2
Pclass 3
Sex 2
Age 88
SibSp 7
Parch 7
Cabin 147
Embarked 3

In [57]:
data.drop("Cabin",axis = 1,inplace=True)

In [58]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

In [59]:
data.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Embarked      2
dtype: int64

In [60]:
data.shape

(891, 7)

In [61]:
data["FamilySize"] = data["Parch"]+data["SibSp"]

In [62]:
data.drop(["Parch","SibSp"],inplace=True,axis = 1)

In [63]:
data.head()

   Survived  Pclass     Sex   Age Embarked  FamilySize
0         0       3    male  22.0        S           1
1         1       1  female  38.0        C           1
2         1       3  female  26.0        S           0
3         1       1  female  35.0        S           1
4         0       3    male  35.0        S           0

In [64]:
for i in data.columns:
    print("{} {}".format(i,data[i].nunique()))

Survived 2
Pclass 3
Sex 2
Age 88
Embarked 3
FamilySize 9